app/controllers/likes_controller.rb

  def create
    @like = Like.new(
        user_id: @current_user.id,
        post_id: params[:post_id]
    )
    @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["post_id", 17], ["created_at", "2025-05-30 11:48:17.931474"], ["updated_at", "2025-05-30 11:48:17.931474"]]

  def destroy
    @like = Like.find_by(
        user_id: @current_user.id,
        post_id: params[:post_id]
    )
    @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 8], ["post_id", 17], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]