app/controllers/posts_controller.rb

  def index #投稿一覧
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show #投稿詳細
    @post = Post.find_by(id: params[:id]) #urlのidと等しいデータを取得
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count #いいね数
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 17]]

  def create #新規投稿
    @post = Post.new(
      content: params[:content], #ここのparamsは「name="○○"」が付いたフォームの入力内容を受け取る
      user_id: @current_user.id
      )
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "あふぁ"], ["created_at", "2025-05-30 15:21:11.476344"], ["updated_at", "2025-05-30 15:21:11.476344"], ["user_id", 2]]

  def edit #投稿編集
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def update #投稿更新
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "ゴリラです。ウホウホ…"], ["updated_at", "2025-05-30 16:17:10.702715"], ["id", 18]]

  def destroy #投稿削除
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 16]]

  def ensure_correct_user #投稿に紐づくユーザーと現在ログインしているユーザーが異なるかどうかを比べる
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]