app/controllers/users_controller.rb

  def index #ユーザー一覧
    @users = User.all #ユーザーのデータをすべて取得
---
SELECT "users".* FROM "users"

  def show #ユーザー詳細
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create #ユーザー登録、データベース保存
    @user = User.new(
      name: params[:name],
       email: params[:email],
       image_name: "default_user.jpg",
       password: params[:password]
       )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def edit #ユーザー編集
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update #ユーザー編集、データベース更新
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image] #画像が送信されたら。
      @user.image_name = "#{@user.id}.jpg" #画像をuserのidの名前に変更、上書き
      image = params[:image] #フォームから送信された画像データをimageに代入
      #(ファイルの場所, ファイルの中身)画像ファイルを作成。画像が特殊なテキストより、binwrite。readで画像を読み込む。
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["updated_at", "2025-05-30 16:16:08.844210"], ["image_name", "2.jpg"], ["id", 2]]

  def login
    #emailとpasswordが一致するデータを取得
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "wanko@prog-8.com"], ["LIMIT", 1]]

  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 8]]