app/models/post.rb

    def user #インスタンスメソッド
        return User.find_by(id: self.user_id) #selfはインスタンス自身をさす
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]